#include "common.h"
#include "button_chk.h"
/*構造体　定義*/
typedef struct  
{
	UCHR tim;
	UCHR pre;
}SND;

typedef struct{
	ULONG tim;
	UCHR pre;
	}TIM;

char active = 0;

int main(void)
{
    /*スイッチ入力に伴う初期化*/
	DDRD &= 0b10111111;
	/*ブザー出力に伴う初期化*/
	DDRD |= 0b00100000;
	OCR0A = 119;
	TCCR0A = 0b00000000;
	TCCR0B = 0b00000000;
	TIMSK0 = 0b00000000;
	/*タイマ1割込みに伴う初期化*/
	OCR1A = 31249;
	TCCR1A = 0b00000000;
	TCCR1B = 0b00001100;
	TIMSK1 = 0b00000000;
	sei();
    while (1) 
    {
		if (button_chk() == SW_ON)
		{
			active ^= 1;
			if (active == 1)
			{
				TCNT1=0;
				TIFR1 = 0b00100111;
				TIMSK1 = 0b00000010;
			}
			
			while(button_chk() != SW_OFF);
		}
    }
	return 0;
}

ISR(TIMER1_COMPA_vect){
	static SND snd[42] = {{118, 0x04},/*ド*/
	                     {118, 0x04},/*ド*/
	                     { 79, 0x04},/*ソ*/
	                     { 79, 0x04},/*ソ*/
	                     { 70, 0x04},/*ラ*/
	                     { 70, 0x04},/*ラ*/
	                     { 79, 0x04},/*ソ*/	 
	                     { 88, 0x04},/*ファ*/
						 { 88, 0x04},/*ファ*/	 
						 { 94, 0x04},/*ミ*/	 
						 { 94, 0x04},/*ミ*/
						 {105, 0x04},/*レ*/
						 {105, 0x04},/*レ*/
						 {118, 0x04},/*ド*/
						 { 79, 0x04},/*ソ*/ 
						 { 79, 0x04},/*ソ*/ 
						 { 88, 0x04},/*ファ*/
						 { 88, 0x04},/*ファ*/
						 { 94, 0x04},/*ミ*/
						 { 94, 0x04},/*ミ*/
						 {105, 0x04},/*レ*/ 	
						 { 79, 0x04},/*ソ*/
						 { 79, 0x04},/*ソ*/
						 { 88, 0x04},/*ファ*/ 
						 { 88, 0x04},/*ファ*/	 
						 { 94, 0x04},/*ミ*/
						 { 94, 0x04},/*ミ*/
						 {105, 0x04},/*レ*/
						 {118, 0x04},/*ド*/
						 {118, 0x04},/*ド*/
						 { 79, 0x04},/*ソ*/
						 { 79, 0x04},/*ソ*/
						 { 70, 0x04},/*ラ*/
						 { 70, 0x04},/*ラ*/
						 { 79, 0x04},/*ソ*/	 	 	 	 	 	 	 
						 { 88, 0x04},/*ファ*/
						 { 88, 0x04},/*ファ*/
						 { 94, 0x04},/*ミ*/
						 { 94, 0x04},/*ミ*/
						 {105, 0x04},/*レ*/
						 {105, 0x04},/*レ*/
						 {118, 0x04},/*ド*/ 	  	 	 	 	 	  	 	 	 	 	  	 	 	 	 
							 };

							 


							 	 	  
static int cnt;

if ((active == 1) && (cnt <42))
{
	TCCR0A = 0b00010010;
	TCCR0B = snd[cnt].pre;
	OCR0A = snd[cnt].tim;
	cnt++;
}else{
	TCCR0A = 0b00000000;
	TCCR0B = 0b00000000;
	TIMSK1 = 0b00000000;
	cnt = 0;
	active = 0;
  }
}
							 

/****************************************************/
/* 				TK210466 西原　葵 　　　　　　　　　　*/
/***************************************************/